app/Controllers/Home.php

DELETE FROM `tb_pessoas`
WHERE `id` IN ('6')
---
    public function excluir($id = null) {
        $model = new PessoasModel();
        $model->delete($id);